src/Documents/итУстановкаУдельныхРозничныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>итУстановкаУдельныхРозничныхЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.итУдельныеРозничныеЦены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Крепость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельнаяЦена_Группа1</Name>
							<Comment>Бренди и другая алкогольная продукция, произведенная из винного, виноградного, плодового, коньячного, кальвадосного, вискового дистиллятов, за исключением коньяка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельнаяЦена_Группа2</Name>
							<Comment>Коньяк</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельнаяЦена_Группа3</Name>
							<Comment>Игристое вино</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельнаяЦена_Группа4</Name>
							<Comment>Водка</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдельнаяЦена_Группа5</Name>
							<Comment>Другой крепкий алкоголь и неалкогольные товары</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/итУдельныеРозничныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>итУдельныеРозничныеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдельнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьWebСервисОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рарус</Name>
					<Comment>Rarus</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКМ5</Name>
					<Comment>Сарабеев</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВидыАлкогольнойПродукции</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итНомерГруппыГАК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итУдельныйОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итОтключитьКонтрольСоответствияКодаГак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итОтключитьКонтрольКрепости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыПересортаПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>итИсключенияОбъемныхКоэфф</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МинимальныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальныйОбъем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемИскл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/итУстановкаУдельныхРозничныхЦен/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Запись движений
	ГруппыГАК = ПолучитьГруппыГАК();
	
	Движения.итУдельныеРозничныеЦены.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеДокумента Из ДанныеДокумента Цикл
		
		Для Каждого стрГруппа Из ГруппыГАК Цикл
			
			УдельнаяЦена =  ТекСтрокаДанныеДокумента["УдельнаяЦена_Группа" + Строка(стрГруппа.НомерГруппыГАК)];
			Если УдельнаяЦена > 0 Тогда
				Движение 			  = Движения.итУдельныеРозничныеЦены.Добавить();
				Движение.Период 	  = Дата;
				Движение.Крепость 	  = ТекСтрокаДанныеДокумента.Крепость;
				Движение.УдельнаяЦена = УдельнаяЦена;
				Движение.Группа 	  = стрГруппа.Группа;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	//Регистрация движений для кассы
	ОбновитьТоварыВОборудовании(Движения.итУдельныеРозничныеЦены.Выгрузить(), Отказ);	
	
КонецПроцедуры

Функция ПолучитьГруппыГАК()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	ВидыАлкогольнойПродукции.Ссылка КАК Группа
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|ГДЕ
	|	ВидыАлкогольнойПродукции.ЭтоГруппа = ИСТИНА
	|	И ВидыАлкогольнойПродукции.ПометкаУдаления = ЛОЖЬ
	|	И ВидыАлкогольнойПродукции.итНомерГруппыГАК МЕЖДУ 1 И 5";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаГрупп	= РезультатЗапроса.Выгрузить();		
	
	Возврат ТаблицаГрупп;
	
КонецФункции

Процедура ОбновитьТоварыВОборудовании(ТаблицаНовыхУдельныхЦен, Отказ)
				
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаНовыхУдельныхЦен.Группа КАК Группа,
	|	ТаблицаНовыхУдельныхЦен.Крепость КАК Крепость,
	|	ТаблицаНовыхУдельныхЦен.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втНовыеУдельныеЦены
	|ИЗ
	|	&ТаблицаНовыхУдельныхЦен КАК ТаблицаНовыхУдельныхЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втТекущиеУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&Период, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНовыеУдельныеЦены.Группа КАК Группа,
	|	втТекущиеУдельныеЦены.Группа КАК ГруппаТекущая
	|ПОМЕСТИТЬ втГруппыДляРегистрации
	|ИЗ
	|	втНовыеУдельныеЦены КАК втНовыеУдельныеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТекущиеУдельныеЦены КАК втТекущиеУдельныеЦены
	|		ПО втНовыеУдельныеЦены.Группа = втТекущиеУдельныеЦены.Группа
	|			И втНовыеУдельныеЦены.Крепость = втТекущиеУдельныеЦены.Крепость
	|			И втНовыеУдельныеЦены.УдельнаяЦена = втТекущиеУдельныеЦены.УдельнаяЦена
	|ГДЕ
	|	втТекущиеУдельныеЦены.Группа ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидАлкогольнойПродукции В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				втГруппыДляРегистрации.Группа КАК Группа
	|			ИЗ
	|				втГруппыДляРегистрации КАК втГруппыДляРегистрации)";
	
	Запрос.УстановитьПараметр("Ссылка",                		Ссылка);
	Запрос.УстановитьПараметр("ТипРарус",                	Перечисления.ТипыПодключаемогоОборудования.Рарус);
	Запрос.УстановитьПараметр("Период",                		Новый Граница(Дата, ВидГраницы.Исключая));	
	Запрос.УстановитьПараметр("ТаблицаНовыхУдельныхЦен",    ТаблицаНовыхУдельныхЦен);
	МастерКлючГруппыРабПодразделения = "000003458";
	Запрос.УстановитьПараметр("РабочиеПодразделения",       Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", МастерКлючГруппыРабПодразделения));	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	МассивНоменалатур= Новый Массив;
	
	
	Пока Выборка.Следующий() Цикл
		МассивНоменалатур.Добавить(Выборка.Номенклатура);	
	КонецЦикла;	
	
	Если МассивНоменалатур.Количество() Тогда
		ОбменДаннымиСобытия.ЗарегистрироватьИзмененияРегистраТоварыВОборудовании(МассивНоменалатур);
	КонецЕсли;
	
КонецПроцедуры
